import React from 'react';
import './PricePage.scss'; 

export default function PricePage() {
  const services = [
    {
      id: 1,
      name: 'Класс аэробики',
      image: '/assets/photo_7.jpg', 
      price: '£8 - £12 за занятие',
      description: 'Энергичные групповые занятия, включающие кардио-упражнения под музыку. Классы направлены на улучшение выносливости, сжигание калорий и укрепление сердечно-сосудистой системы. Подходит для участников разного уровня физической подготовки.',
    },
    {
      id: 2,
      name: 'Групповые программы',
      image: '/assets/photo_8.jpg', 
      price: '£10 - £15 за занятие',
      description: 'Занятия в группе, которые могут включать различные виды тренировок, такие как функциональный тренинг, зумба или кроссфит. Групповые программы способствуют мотивации и созданию дружеской атмосферы, а также помогают достигать фитнес-целей быстрее.',
    },
    {
      id: 3,
      name: 'Персональный тренер',
      image: '/assets/photo_9.jpg', 
      price: '£30 - £60 за час',
      description: 'Индивидуальные тренировки с квалифицированным тренером, который разрабатывает персонализированную программу в зависимости от ваших целей и физического состояния. Персональный тренер обеспечивает поддержку, мотивацию и корректирует технику выполнения упражнений.',
    },
    {
      id: 4,
      name: 'Класс йоги',
      image: '/assets/photo_10.jpg', 
      price: '£10 - £15 за занятие',
      description: 'Занятия йогой для всех уровней, направленные на повышение гибкости, силы и расслабления. Вы изучите асаны, дыхательные техники и медитацию под руководством опытного инструктора в поддерживающей атмосфере.',
    },
    {
        id: 5,
        name: 'Функциональный тренинг',
        image: '/assets/photo_11.jpg', 
        price: '£10 - £15 за занятие',
        description: 'Программа, направленная на развитие силы, выносливости и координации с использованием различных функциональных упражнений, которые имитируют повседневные движения, что помогает улучшить общую физическую форму и избежать травм.',
      },
      {
        id: 6,
        name: 'Класс пилатеса',
        image: '/assets/photo_12.jpg',
        price: '£10 - £15 за занятие',
        description: 'Этот класс сосредоточен на укреплении мышц, улучшении гибкости и осанки с помощью специальных упражнений, что делает его отличным дополнением к традиционным фитнес-программам.',
      }
  ];

  return (
    <section className="price-page">
      <div className="centered-container">
        <h2 className="section-title">Наши услуги</h2>

        <div className="services-grid">
          {services.map((service) => (
            <div key={service.id} className="service-card">
              <img 
                src={service.image} 
                alt={service.name} 
                className="service-image"
              />
              <div className="service-details">
                <h3 className="service-name">{service.name}</h3>
                <p className="service-price">{service.price}</p>
                <p className="service-description">{service.description}</p>
                <button className="service-button">Записаться</button>
              </div>
            </div>
          ))}
        </div>
      </div>
    </section>
  );
}